In [495]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [496]:
dataFrame = pd.read_csv("persona.csv")

In [497]:
def genelBilgiGetir(dataFrame):
    print(dataFrame.describe())
    print("######################")
    print(dataFrame.shape)
    print("######################")
    print(dataFrame.info())
    print("######################")
    print(dataFrame.size)
    print("######################")
    print(dataFrame.nunique)
    print("######################")

In [498]:
genelBilgiGetir(dataFrame)

             PRICE          AGE
count  5000.000000  5000.000000
mean     34.132000    23.581400
std      12.464897     8.995908
min       9.000000    15.000000
25%      29.000000    17.000000
50%      39.000000    21.000000
75%      39.000000    27.000000
max      59.000000    66.000000
######################
(5000, 5)
######################
<class 'pandas.core.frame.DataFrame'>
Int64Index: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   PRICE    5000 non-null   int64
 1   SOURCE   5000 non-null   object
 2   SEX      5000 non-null   object
 3   COUNTRY  5000 non-null   object
 4   AGE      5000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 234.4+ KB
None
######################
25000
######################
<bound method DataFrame.nunique of       PRICE   SOURCE     SEX COUNTRY  AGE
0        39  android    male     bra   17
1        39  android    male     bra   17
2        49  android    male     bra   17
3        29  android    male     tur   17
4        49  android    male     tur   17
...     ...      ...     ...     ...  ...
4995     29  android  female     bra   31
4996     29  android  female     bra   31
4997     29  android  female     bra   31
4998     39  android  female     bra   31
4999     29  android  female     bra   31

[5000 rows x 5 columns]>
######################

In [499]:
dataFrame["SOURCE"].unique()

array(['android', 'ios'], dtype=object)

In [500]:
dataFrame["PRICE"].unique()

array([39, 49, 29, 19, 59,  9], dtype=int64)

In [501]:
dataFrame.groupby("PRICE").count()

       SOURCE   SEX  COUNTRY   AGE
PRICE
9         200   200      200   200
19        992   992      992   992
29       1305  1305     1305  1305
39       1260  1260     1260  1260
49       1031  1031     1031  1031
59        212   212      212   212

In [502]:
dataFrame["PRICE"].value_counts()

29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: PRICE, dtype: int64

In [503]:
dataFrame["COUNTRY"].value_counts()

usa    2065
bra    1496
deu     455
tur     451
fra     303
can     230
Name: COUNTRY, dtype: int64

In [504]:
dataFrame.columns

Index(['PRICE', 'SOURCE', 'SEX', 'COUNTRY', 'AGE'], dtype='object')

In [505]:
dataFrame.groupby("COUNTRY")["PRICE"].sum()

COUNTRY
bra    51354
can     7730
deu    15485
fra    10177
tur    15689
usa    70225
Name: PRICE, dtype: int64

In [506]:
dataFrame.groupby("SOURCE")["PRICE"].count()

SOURCE
android    2974
ios        2026
Name: PRICE, dtype: int64

In [507]:
dataFrame["SOURCE"].value_counts()

android    2974
ios        2026
Name: SOURCE, dtype: int64

In [508]:
dataFrame.groupby("COUNTRY").agg({"PRICE":"mean"})

             PRICE
COUNTRY
bra      34.327540
can      33.608696
deu      34.032967
fra      33.587459
tur      34.787140
usa      34.007264

In [509]:
dataFrame.groupby("COUNTRY")["PRICE"].mean()

COUNTRY
bra    34.327540
can    33.608696
deu    34.032967
fra    33.587459
tur    34.787140
usa    34.007264
Name: PRICE, dtype: float64

In [510]:
dataFrame.groupby("SOURCE").agg({"PRICE":"mean"})

             PRICE
SOURCE
android  34.174849
ios      34.069102

In [511]:
dataFrame.groupby(["COUNTRY","SOURCE"]).agg({"PRICE":"mean"})

                     PRICE
COUNTRY SOURCE
bra     android  34.387029
        ios      34.222222
can     android  33.330709
        ios      33.951456
deu     android  33.869888
        ios      34.268817
fra     android  34.312500
        ios      32.776224
tur     android  36.229437
        ios      33.272727
usa     android  33.760357
        ios      34.371703

In [512]:
dataFrame.groupby(["COUNTRY","SOURCE","SEX","AGE"]).agg({"PRICE":"mean"})

                                PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.714286
                       16   35.944444
                       17   35.666667
                       18   32.255814
                       19   35.206897
...                               ...
usa     ios     male   42   30.250000
                       50   39.000000
                       53   34.000000
                       55   29.000000
                       59   46.500000

[348 rows x 1 columns]

In [513]:
agg_df = dataFrame.groupby(["COUNTRY","SOURCE","SEX","AGE"]).agg({"PRICE":"mean"}).sort_values(by="PRICE",ascending=False)

In [514]:
agg_df.head()

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46    59.0
usa     android male   36    59.0
fra     android female 24    59.0
usa     ios     male   32    54.0
deu     android female 36    49.0

In [515]:
agg_df.reset_index(inplace=True)

In [516]:
agg_df["CAT_AGE"] = pd.cut(x=agg_df["AGE"],bins=[0,18,23,30,40,70],labels=["COCUK","GENÇ","YETISKIN","OLGUN","YASLI"])
agg_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 348 entries, 0 to 347
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   COUNTRY  348 non-null    object
 1   SOURCE   348 non-null    object
 2   SEX      348 non-null    object
 3   AGE      348 non-null    int64
 4   PRICE    348 non-null    float64
 5   CAT_AGE  348 non-null    category
dtypes: category(1), float64(1), int64(1), object(3)
memory usage: 14.3+ KB

In [517]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE   CAT_AGE
0     bra  android    male   46   59.0     YASLI
1     usa  android    male   36   59.0     OLGUN
2     fra  android  female   24   59.0  YETISKIN
3     usa      ios    male   32   54.0     OLGUN
4     deu  android  female   36   49.0     OLGUN

In [518]:
agg_df["CAT_AGE"].unique()

['YASLI', 'OLGUN', 'YETISKIN', 'GENÇ', 'COCUK']
Categories (5, object): ['COCUK' < 'GENÇ' < 'YETISKIN' < 'OLGUN' < 'YASLI']

In [519]:
agg_df["CAT_AGE"].unique()
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE   CAT_AGE
0     bra  android    male   46   59.0     YASLI
1     usa  android    male   36   59.0     OLGUN
2     fra  android  female   24   59.0  YETISKIN
3     usa      ios    male   32   54.0     OLGUN
4     deu  android  female   36   49.0     OLGUN

In [520]:
agg_df["customers_level_based"] = agg_df["COUNTRY"].str.upper()+"_"+agg_df["SOURCE"].str.upper()+"_"+agg_df["SEX"].str.upper()+"_"+agg_df["CAT_AGE"].str.upper()

In [521]:
agg_df["customers_level_based"].nunique()

109

In [522]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE   CAT_AGE        customers_level_based
0     bra  android    male   46   59.0     YASLI       BRA_ANDROID_MALE_YASLI
1     usa  android    male   36   59.0     OLGUN       USA_ANDROID_MALE_OLGUN
2     fra  android  female   24   59.0  YETISKIN  FRA_ANDROID_FEMALE_YETISKIN
3     usa      ios    male   32   54.0     OLGUN           USA_IOS_MALE_OLGUN
4     deu  android  female   36   49.0     OLGUN     DEU_ANDROID_FEMALE_OLGUN

In [523]:
agg_df.drop(["COUNTRY","SOURCE","SEX","AGE","CAT_AGE"],axis=1,inplace=True)

In [529]:
agg_df

     PRICE        customers_level_based
0     59.0       BRA_ANDROID_MALE_YASLI
1     59.0       USA_ANDROID_MALE_OLGUN
2     59.0  FRA_ANDROID_FEMALE_YETISKIN
3     54.0           USA_IOS_MALE_OLGUN
4     49.0     DEU_ANDROID_FEMALE_OLGUN
..     ...                          ...
343   19.0         USA_IOS_FEMALE_OLGUN
344   19.0      USA_IOS_FEMALE_YETISKIN
345   19.0  CAN_ANDROID_FEMALE_YETISKIN
346   19.0       FRA_ANDROID_MALE_COCUK
347    9.0    DEU_ANDROID_MALE_YETISKIN

[348 rows x 2 columns]

In [530]:
new_df = pd.DataFrame(agg_df.groupby("customers_level_based").agg({"PRICE":"mean"}))

In [531]:
new_df.reset_index(inplace=True)

In [532]:
new_df.nunique()

customers_level_based    109
PRICE                     96
dtype: int64

In [533]:
new_df.head()

         customers_level_based      PRICE
0     BRA_ANDROID_FEMALE_COCUK  35.645303
1      BRA_ANDROID_FEMALE_GENÇ  34.077340
2     BRA_ANDROID_FEMALE_OLGUN  34.898326
3     BRA_ANDROID_FEMALE_YASLI  36.737179
4  BRA_ANDROID_FEMALE_YETISKIN  33.863946

In [534]:
new_df["SEGMENT"] = pd.qcut(new_df["PRICE"],4,labels=["A","B","C","D"])

In [539]:
new_df["PRICE"].max()

45.42857142857143

In [540]:
new_df.groupby("SEGMENT").agg({"PRICE":["mean","max","sum","min"]})

             PRICE
              mean        max          sum        min
SEGMENT
A        29.206780  32.333333   817.789833  19.000000
B        33.509674  34.077340   904.761209  32.500000
C        34.999645  36.000000   944.990411  34.103727
D        38.691234  45.428571  1044.663328  36.060606

In [541]:
new_user = "TUR_ANDROID_FEMALE_OLGUN"

In [542]:
new_df[new_df["customers_level_based"]==new_user]

       customers_level_based      PRICE SEGMENT
71  TUR_ANDROID_FEMALE_OLGUN  41.833333       D